//출처 : http://breadshuttle.tistory.com/entry/C%EC%96%B8%EC%96%B4-%EC%8B%AC%EC%8B%AC%ED%92%80%EC%9D%B4%EA%B2%8C%EC%9E%84%EB%A7%8C%EB%93%A4%EC%96%B4%EB%B3%B4%EA%B8%B02%ED%83%84
#include<stdio.h>
#include<conio.h>
#include<windows.h>
#include <mmsystem.h>

#pragma comment(lib,"winmm.lib") // playsound함수를 사용하기 위해 #pragma매크로 사용 -> lib파일 읽어들이는데 사용.
//발표 12일 보고서 17일까지
#define LEFT 75                     
#define RIGHT 77                     
#define UP 72                          
#define DOWN 80                    

typedef struct rank {
	int rankNum;
	char name[10];
	int score;
	struct rank *next;
}RANK;

void gotoxy(int x, int y); // gotoxy함수 정의       
COORD getXY();
COORD Cur;

void setmap();                      
int move(char ch);               
void enemyMove(char *x, char *y);

void disappear(); //커서 화면 삭제

void save(int stage, int *scoreP);
int load();

void printTitle(); //기본적인 타이틀 출력 (봉재의 햄버거 여행기)
void gameMenu(); // 게임메뉴 출력함수
void gameMenuSelector(); // 게임 메뉴 선택 함수
void Title(); // printTitle, gameMenu, gameMenuSelector 함수 총괄, BGM
void gameStart(); // 게임 맵함수
void Intro1(); // 인트로 1
void Intro1_1(); // 인트로 1-1
void Intro2(); // 인트로 2
void Intro3(); //인트로 3
void Ending(); //엔딩
void credit(); //크레딧
void goRank(int score);
void printRank();
void loadGame();

char(*map)[50];
char empty[50][50];



 int enemyCount = 0;
 int enemySt = 1;
 int stage = 1;
 int score; //점수
 int *scoreP=&score;
 int life=3;
 int UserReverse = 1; //좌우 반전 아이템 변수

 char startx = 0;                       
 char starty = 0;
										

 char u1x = 0;
 char u1y = 0;

 char u2x = 0;
 char u2y = 0;

 char u3x = 0;
 char u3y = 0;

 char u4x = 0;
 char u4y = 0;

void initialization();

int food = 1;//자신의 위치를 포함(1부터 시작)
			

char map_1[50][50] =
{
	{ 5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6 },//5가 청 6이 적  17 16 17
	{ 5,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,5,0,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,5,0,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,5,0,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,5,0,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6 },//y 23 x25
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,0,0,0,0,0,0,0,0,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,0,0,0,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,0,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,0,5,5,5,5,5,5,5,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,0,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,6,6,6,6,6,0,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,6,6,6,6,6,0,6,6,6,0,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,0,6 },
	{ 5,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,6 },
	{ 5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6 }

};	//크레이지아케이드(프랑스)

char map_2[50][50] =
{
	{ 5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6 },//17 *25  4줄씩 빨흰
	{ 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,6 },
	{ 5,0,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,6,6,6,6,6,6,6,7,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,0,6 },
	{ 5,0,0,0,5,1,5,1,5,1,5,1,5,1,5,1,5,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,0,6 },
	{ 5,0,5,0,0,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,1 },
	{ 5,0,5,1,0,0,5,1,5,1,5,1,5,1,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,0,1 },
	{ 5,0,5,5,5,0,0,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,0,1 },
	{ 5,0,5,1,5,1,0,0,5,1,5,1,5,1,5,1,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,0,1 },
	{ 5,0,5,5,5,5,5,0,0,5,5,5,5,5,5,5,5,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,0,6 },
	{ 5,0,5,1,5,1,5,5,0,0,5,1,5,1,5,5,5,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,0,0,5,5,5,5,5,5,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,1,5,1,5,1,5,1,0,0,5,1,5,1,5,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,0,0,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,1,5,1,5,1,5,1,5,5,0,0,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,0,0,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,1,5,1,5,1,5,1,5,1,5,1,0,0,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,0,0,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,1,5,1,5,1,5,1,5,1,5,1,5,5,0,0,6,6,6,6,6,6,0,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,0,6,6,6,6,6,0,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,1,5,1,5,1,5,1,5,1,5,1,5,5,5,6,0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,0,0,0,1,1,1,0,1,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,1,5,1,5,1,5,1,5,1,5,1,5,5,5,1,0,1,0,0,1,1,0,1,1,0,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,0,1,1,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,0,1,1,1,0,0,0,0,0,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 5,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8,6 }, //y 24 x25
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,0,0,0,0,0,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,0,0,0,0,0,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,0,0,6,0,6,0,0,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,1,1,0,1,1,0,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,0,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,0,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,0,6 },
	{ 1,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,0,1 },
	{ 1,0,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,0,1 },
	{ 6,0,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,0,6 },
	{ 6,0,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,0,6 },
	{ 1,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,0,1 },
	{ 1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,1 },
	{ 1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,0,1 },
	{ 1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1 },
	{ 6,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6 },
	{ 6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6 }

};	//영국->미국

char map_3[50][50] =
{
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
	{ 1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,4,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,6,6,6,6,6,6,6,6,6,6,6,6,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,0,0,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,0,0,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,1,6,6,6,6,6,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,1,1,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,6,6,6,6,6,6,0,0,0,0,0,0,0,0,0,0,0,0,6,6,6,6,6,6,1,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,6,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,6,6,6,6,6,6,6,6,6,6,6,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,6,6,6,6,6,6,6,6,6,6,6,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,6,6,6,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,6,6,6,6,6,6,6,6,6,6,6,0,0,0,2,0,0,0,0,5,5,5,5,5,5,5,5,5,5,6,1,0,1,1,1,1,1,1,1,1 },//y 19 24
	{ 1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,6,6,6,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,5,5,5,5,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,5,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,1,1,1,1,1,1,1,1 },
	{ 1,8,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,5,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,1 },
	{ 1,0,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,6,5,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,1 },
	{ 1,0,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,5,5,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,1 },
	{ 1,4,0,0,0,0,0,0,0,6,6,6,6,6,6,6,6,6,6,0,6,6,6,6,5,5,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,4,1 },
	{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1 },
	{ 1,0,0,0,0,0,0,0,0,1,5,5,6,6,0,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,5,1,0,0,0,0,0,0,0,8,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,5,5,5,0,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,5,5,0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,0,5,5,5,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,5,0,5,5,5,5,0,0,0,0,0,7,0,0,0,0,0,0,5,5,5,5,0,5,5,5,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,5,0,5,5,5,5,0,5,5,5,5,5,5,5,5,5,5,0,5,5,5,5,0,5,5,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1 },
	{ 1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,4,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1 },
	{ 1,1,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1 },
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 }
};	//한국으로 변경 !


void main()
{
	
	map = &empty;
	system("mode con:cols=130 lines=53");
	
	disappear();// 처음부터 커서를 제거함. 11.28 수정
	Title();
	
	//main();
}

void gameStart()
{
	map = &empty;
	system("mode con:cols=130 lines=53");
	initialization();//이하 맵 셋팅;

	int state = 3;
	int key = 1;//초기화를 안하면 if문에서 에러가 나므로, 아무 값이나 초기화.

	//memcpy(empty, map_1, sizeof(map_1)); // or memcpy(dstArr, srcArr, sizeof(int) * ARR_SIZE); 배열 복사 ->http://kkikkodev.tistory.com/51
	//copy_array(map_1, empty, 50);//empty에 map_1 배열을 복사.

	int i,j;
	for (i = 0; i < 50; i++)
	{
		for (j = 0; j < 50; j++)
		{
			empty[i][j] = map_1[i][j];
		}
	}

	setmap();  //2-1

	while (1)                             //2-2
	{

		enemyMove(&u1x, &u1y);


		if (enemyCount >= 2)//유령의 갯수를 파악하여 움직임..
		{
			enemyMove(&u2x, &u2y);
			if (enemyCount >= 3)
			{
				enemyMove(&u3x, &u3y);
				if (enemyCount >= 4)
				{
					enemyMove(&u4x, &u4y);
				}
			}
		}

		if (startx == u1x&&starty == u1y && startx == u2x&&starty == u2y && startx == u3x&&starty == u3y && startx == u4x&&starty == u4y)//유령[1,2,3,4 {(,)는 or}]에 닿을때
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}
		//--------------------------------------------------------------------------------------------------유령의 움직임을 2번으로 설정함 //(스테이지별로 if문 걸어서 난이도 설정 가능..)
		enemyMove(&u1x, &u1y);

		//printf(" %d %d", u1x, u1y);

		if (enemyCount >= 2)//유령의 갯수를 파악하여 움직임..
		{
			enemyMove(&u2x, &u2y);
			if (enemyCount >= 3)
			{
				enemyMove(&u3x, &u3y);
				if (enemyCount >= 4)
				{
					enemyMove(&u4x, &u4y);
				}
			}
		}

		if (startx == u1x&&starty == u1y && startx == u2x&&starty == u2y && startx == u3x&&starty == u3y && startx == u4x&&starty == u4y)//유령[1,2,3,4 {(,)는 or}]에 닿을때
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER");
				initialization();
				break;// 탈출
			}
		}


		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 

		state = move(key);//움직이며 상태 변수를 반환.
		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");
					
					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}


		//--------------------------------------------------------------------------------------------------유저의 움직임을 3번으로 설정함 ㅠㅠ//(스테이지별로 if문 걸어서 난이도 설정 가능..)
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 
		state = move(key);//움직이며 상태 변수를 반환.

		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}
		//--------------------------------------------------------------------------------------------------유저의 움직임을 3번으로 설정함 ㅠㅠ//(스테이지별로 if문 걸어서 난이도 설정 가능..)
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 
		state = move(key);//움직이며 상태 변수를 반환.

		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}
			
			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}


	}
	system("cls");
	gotoxy(50, 20);
	goRank(score);
	score = 0;
	while (key != 32)                   //2-4
	{
		key = _getch();
		//gotoxy(101   , 26);    
		gotoxy(35, 25);// 위치 변경 12. 02 수정
		printf("- SPACE바를 누르면 메뉴로 -\n");
		if (GetAsyncKeyState(VK_SPACE)) // 이니셜 입력 후 스페이스바를 누르면 타이틀로 이동 12. 02 추가
		{
			Title();
		}
	}



}

void loadGame()
{
	system("mode con:cols=130 lines=53");
	int state = 3;
	int key = 1;//초기화를 안하면 if문에서 에러가 나므로, 아무 값이나 초기화.

	map = &empty;
	int i, j;

	if (stage == 1)
	{
		PlaySound(TEXT("La Marseillaise.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	}
	else if (stage == 2)
	{
		PlaySound(TEXT("America Theme.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	}
	else if (stage == 3)
	{
		PlaySound(TEXT("wish of korea.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP); // 로딩시 스테이지 3 브금 출력 12.11 수정
	}

	setmap();  //2-1

	while (1)                             //2-2
	{

		enemyMove(&u1x, &u1y);


		if (enemyCount >= 2)//유령의 갯수를 파악하여 움직임..
		{
			enemyMove(&u2x, &u2y);
			if (enemyCount >= 3)
			{
				enemyMove(&u3x, &u3y);
				if (enemyCount >= 4)
				{
					enemyMove(&u4x, &u4y);
				}
			}
		}

		if (startx == u1x&&starty == u1y && startx == u2x&&starty == u2y && startx == u3x&&starty == u3y && startx == u4x&&starty == u4y)//유령[1,2,3,4 {(,)는 or}]에 닿을때
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}
			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}
		//--------------------------------------------------------------------------------------------------유령의 움직임을 2번으로 설정함 //(스테이지별로 if문 걸어서 난이도 설정 가능..)
		enemyMove(&u1x, &u1y);

		//printf(" %d %d", u1x, u1y);

		if (enemyCount >= 2)//유령의 갯수를 파악하여 움직임..
		{
			enemyMove(&u2x, &u2y);
			if (enemyCount >= 3)
			{
				enemyMove(&u3x, &u3y);
				if (enemyCount >= 4)
				{
					enemyMove(&u4x, &u4y);
				}
			}
		}

		if (startx == u1x&&starty == u1y && startx == u2x&&starty == u2y && startx == u3x&&starty == u3y && startx == u4x&&starty == u4y)//유령[1,2,3,4 {(,)는 or}]에 닿을때
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}
			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}


		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 

		state = move(key);//움직이며 상태 변수를 반환.
		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}
			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}


		//--------------------------------------------------------------------------------------------------유저의 움직임을 3번으로 설정함 ㅠㅠ//(스테이지별로 if문 걸어서 난이도 설정 가능..)
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 
		state = move(key);//움직이며 상태 변수를 반환.

		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}
		//--------------------------------------------------------------------------------------------------유저의 움직임을 3번으로 설정함 ㅠㅠ//(스테이지별로 if문 걸어서 난이도 설정 가능..)
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
			key = _getch();//키를 입력 받음. 
		state = move(key);//움직이며 상태 변수를 반환.

		Sleep(100);

		if (state == 1)
		{
			printf("STAGE CLEAR!!!");//임의 프린트문으로 대체, 맵의 다양해짐에따라 추가 예정
			Sleep(3000);

			initialization();//이하 맵 셋팅;
			stage++;
			if (stage == 2)
			{
				Intro2();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_2[i][j];
					}
				}
				setmap();
			}
			else if (stage == 3)
			{
				Intro3();
				for (i = 0; i < 50; i++)
				{
					for (j = 0; j < 50; j++)
					{
						empty[i][j] = map_3[i][j];
					}
				}
				setmap();
			}

			else if (stage == 4)
			{
				Ending();
				credit();
				break;//탈출
			}

		}
		else if (state == 2)
		{
			if (life > 0)
			{
				switch (stage)
				{
				case 1:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 23;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 2:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 25;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				case 3:
					gotoxy(startx * 2, starty);
					printf(" ");

					startx = 24;
					starty = 19;
					gotoxy(startx * 2, starty);
					printf("◎");
					life--;
					break;
				}
			}

			else
			{
				printf("GAME OVER...");
				initialization();
				break;// 탈출
			}
		}


	}
	system("cls");
	gotoxy(50, 20);
	goRank(score);
	score = 0;
	while (key != 32)                   //2-4
	{
		key = _getch();
		//gotoxy(101   , 26);    
		gotoxy(35, 25);// 위치 변경 12. 02 수정
		printf("- SPACE바를 누르면 메뉴로 -\n");
		if (GetAsyncKeyState(VK_SPACE)) // 이니셜 입력 후 스페이스바를 누르면 타이틀로 이동 12. 02 추가
		{
			Title();
		}
	}
}

int move(char ch)//캐릭터의 벽터치 및 먹이 먹이는 함수
{
	int gameClear=0;
	gotoxy(startx * 2, starty);//팩맨 위치로 커서 이동
	if (UserReverse == 1) //sw 좌우 반전때문에 나눔
	{
		switch (ch)
		{
		case LEFT:                                  //3-1
			if ((map[starty][startx - 1] != 1 )&&( map[starty][startx - 1] != 5) &&( map[starty][startx - 1] != 6))//이동 하는 방향이 벽이 아닌경우     
			{
				printf(" ");//좌표를 이동하기 전0에 현재의 ◎를 지워줍니다.
				startx--;


				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 50;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case RIGHT:
			if ((map[starty][startx + 1] != 1 )&& (map[starty][startx + 1] != 5 )&&( map[starty][startx + 1] != 6))
			{
				printf(" ");
				startx++;


				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 50;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case UP:
			if ((map[starty - 1][startx] != 1 )&& (map[starty - 1][startx] != 5) && (map[starty - 1][startx] != 6))
			{
				printf(" ");
				starty--;

				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 50;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case DOWN:
			if ((map[starty + 1][startx] != 1 )&&( map[starty + 1][startx] != 5 )&&( map[starty + 1][startx] != 6))
			{
				printf(" ");
				starty++;

				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 50;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;//q
		case 113:
			save(stage, *scoreP, empty);
			printf("게임이 저장되었습니다.");
			Sleep(1000);
			main();
			break;

		case 81://Q
			save(stage, *scoreP, empty);
			printf("게임이 저장되었습니다.");
			Sleep(1000);
			main();
			break;
		}
	}
	else //sw ---------------------------좌우 반전 떄문에 나눔-------------------------------------------------
	{
		UserReverse--;
		switch (ch)
		{
		case LEFT:                                  //3-1
			if ((map[starty][startx + 1] != 1) &&( map[starty][startx + 1] != 5) &&( map[starty][startx + 1] != 6))
			{
				printf(" ");
				startx++;


				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 75;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case RIGHT:
			if ((map[starty][startx - 1] != 1) &&( map[starty][startx - 1] != 5 )&&( map[starty][startx - 1] != 6))//이동 하는 방향이 벽이 아닌경우     
			{
				printf(" ");//좌표를 이동하기 전에 현재의 ◎를 지워줍니다.
				startx--;


				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 75;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case UP:
			if ((map[starty + 1][startx] != 1) &&( map[starty + 1][startx] != 5) && (map[starty + 1][startx] != 6))
			{
				printf(" ");
				starty++;

				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 75;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;//q
		case DOWN:
			if ((map[starty - 1][startx] != 1 )&&( map[starty - 1][startx] != 5 )&&( map[starty - 1][startx] != 6))
			{
				printf(" ");
				starty--;

				if (map[starty][startx] == 0)//현재 위치에 먹이가 있었던경우, 차차 함수화 ㅠ
				{
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 7) // 좌우 반전
				{
					UserReverse += 75;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
				else if (map[starty][startx] == 8)//몬스터 도망 아이템 획득시
				{
					enemySt += 20;
					food++;//먹이 먹은갯수 1 추가
					score += 10;//스코어 추가
					map[starty][startx] = 3;//먹이를 먹어, 빈길로 처리
				}
			}
			break;
		case 113:
			save(stage, *scoreP, empty);
			printf("게임이 저장되었습니다.");
			Sleep(1000);
			main();
			break;

		case 81://Q
			save(stage, *scoreP, empty);
			printf("게임이 저장되었습니다.");
			Sleep(1000);
			main();
			break;
		}
	}

	
	int stFood1, stFood2, stFood3;
	stFood1 = 609, stFood2 = 493, stFood3 = 632;
	gotoxy(103, 3);
	switch (stage)
	{
	case 1:
		printf("남은 재료의 개수 : %3d", stFood1 - food); // %3d로 점수 오류 수정 12.10
		break;
	case 2:
		printf("남은 재료의 개수 : %3d", stFood2 - food);
		break;
	case 3:
		printf("남은 재료의 개수 : %3d", stFood3 - food);
		break;
	}
	
	gotoxy(103, 5);
	printf("여행 점수 : %d", score); // 여행점수 출력 => 먹이당 10점.
	if(life == 3) // 목숨
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(103, 7);
		printf("봉재의 목숨 : ");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
		gotoxy(117, 7);
		printf("♥ ♥ ♥ ♥");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	}
	else if (life == 2)
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(117, 7);
		printf("           ");
		gotoxy(103, 7);
		printf("봉재의 목숨 : ");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
		gotoxy(117, 7);
		printf("♥ ♥ ♥");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	}
	else if (life == 1)
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(117, 7);
		printf("        ");
		gotoxy(103, 7);
		printf("봉재의 목숨 : ");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
		gotoxy(117, 7);
		printf("♥ ♥");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	}
	else
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(117, 7);
		printf("     ");
		gotoxy(103, 7);
		printf("봉재의 목숨 : ");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
		gotoxy(117, 7);
		printf("♥");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	}

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
	gotoxy(107, 9);
	printf("＠");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(109, 9);
	printf(": 좌우키 반전");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
	gotoxy(107, 11);
	printf("●");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(109, 11);
	printf(": 도둑들 도망");
	gotoxy(104, 12);
	printf("======================");
	gotoxy(104, 13);
	printf("'Q'키 입력 : 게임 저장");//점수 출력
	gotoxy(104, 14);
	printf("======================");

	gotoxy(startx * 2, starty);                                    
	printf("◎");                                                 



	switch (stage)
	{
	case 1:
		if (food == 100)//609
			return 1;
		break;
	case 2:
		if (food == 100)//493
			return 1;
		break;
	case 3://현재까지 3스테이지 먹이수 체크
		if (food == 100)//632
			return 1;
		break;
	case 4:
		//if (food == 609)
		//	return 1;
		break;

	}
	if (startx == u1x&&starty == u1y && startx == u2x&&starty == u2y && startx == u3x&&starty == u3y && startx == u4x&&starty == u4y)//유령[1,2,3,4 {(,)는 or}]에 닿을때
	{
		return 2;//게임 오버
	}
	else
		return 3;//게임의 진행중
}

void enemyMove(char *x, char *y)//8방으로..
{

	if (enemySt == 1 )
	{
		if (startx > *x && starty > *y)//유저가 유령의 동남쪽에 있을경우
		{

			if (map[*y][*x + 1] != 1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이, 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//아래로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}

		}

		else if (startx > *x && starty == *y)//유저가 유령의 동쪽에 있을경우
		{

			if (map[*y][*x + 1] !=1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx > *x && starty < *y)//유저가 유령의 북동쪽에 있을경우
		{

			if (map[*y][*x + 1] != 1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//위로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}

		}

		else if (startx == *x && starty < *y)//유저가 유령의 북쪽에 있을경우
		{
			if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//위쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx < *x && starty < *y)//유저가 유령의 북서쪽에 있을경우
		{

			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//위로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}
		}

		else if (startx < *x && starty == *y)//유저가 유령의 서쪽에 있을경우
		{
			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx < *x && starty > *y)//유저가 유령의 남서쪽에 있을경우
		{

			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//아래로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}
		}

		else if (startx == *x && starty > *y)//유저가 유령의 남쪽에 있을경우
		{
			if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//아래쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}
	}
	//-------------------------------------이하 아이템 처리부-------------------------------------------
	else if (enemySt > 1)
	{
		if (startx > *x && starty > *y)//유저가 유령의 동남쪽에 있을경우
		{

			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//아래로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}

		}

		else if (startx > *x && starty == *y)//유저가 유령의 동쪽에 있을경우
		{

			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx > *x && starty < *y)//유저가 유령의 북동쪽에 있을경우
		{

			if (map[*y][*x - 1] != 1 && map[*y][*x - 1] != 5 && map[*y][*x - 1] != 6)//오른쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//위로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}

		}


		else if (startx == *x && starty < *y)//유저가 유령의 북쪽에 있을경우
		{
			if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//위쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx < *x && starty < *y)//유저가 유령의 북서쪽에 있을경우
		{

			if (map[*y][*x + 1] != 1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y + 1][*x] != 1 && map[*y + 1][*x] != 5 && map[*y + 1][*x] != 6)//위로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}
		}

		else if (startx < *x && starty == *y)//유저가 유령의 서쪽에 있을경우
		{
			if (map[*y][*x + 1] != 1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
		}

		else if (startx < *x && starty > *y)//유저가 유령의 남서쪽에 있을경우
		{

			if (map[*y][*x + 1] != 1 && map[*y][*x + 1] != 5 && map[*y][*x + 1] != 6)//왼쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*x)++;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
			}
			else if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//아래로 이동 가능시
			{
				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;

				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");                                                     //3-6

				}

			}
		}

		else if (startx == *x && starty > *y)//유저가 유령의 남쪽에 있을경우
		{
			if (map[*y - 1][*x] != 1 && map[*y - 1][*x] != 5 && map[*y - 1][*x] != 6)//아래쪽 방향이 벽이 아닌경우     
			{

				if (map[*y][*x] == 0)//몬스터에게 먹이 안먹이기..
				{
					gotoxy(*x * 2, *y);
					printf("·");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
					//Sleep(200);//게임 전체의 진행속도
				}
				else if (map[*y][*x] == 7)
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
					printf("＠");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 8)//몬스터에게 아이템 안먹이기..
				{
					gotoxy(*x * 2, *y);
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
					printf("●");
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
				else if (map[*y][*x] == 3)
				{
					gotoxy(*x * 2, *y);
					printf(" ");
					(*y)--;
					gotoxy(*x * 2, *y);                                    //3-5
					printf("☆");
					return;
				}
			}
		}
		enemySt--;
	}
	else
		printf("아이템 에러");

}

void initialization()
{
	system("cls");
	enemyCount = 0;
	enemySt = 1;

	food = 1;
	life = 3;
}

void setmap()
{
	char ch;

	initialization();


	for (int i = 0; i<2500 / 50; i++)    //2500은 char[50][50]의 배열 크기, 50은 한 라인의 크기                  //4-1
	{
		for (int j = 0; j<50 / 1; j++)     //1은 char의 바이트 크기       //4-2
		{
			ch = empty[i][j];
			switch (ch)                                                                        //4-3
			{
			case 0:
				printf("·");
				break;
			case 1:
					printf("■");
				break;
			case 2:
				printf("◎");
				startx = j;
				starty = i;
				empty[i][j] = 3;//유저의 프린트 및, 좌표 설정이 끝나면, 그 위치를 3으로 바꿈(유령AI의 이동 용이)
				break;
			case 3:
				printf("  ");
				break;
			case 4:
				printf("☆");
				if (enemyCount == 0)
				{
					u1x = j;
					u1y = i;
					empty[i][j] = 0;//유령의 프린트 및, 좌표 설정이 끝나면, 그 위치를 0(먹이)로 바꿈
					enemyCount++;
				}
				else if (enemyCount == 1)
				{
					u2x = j;
					u2y = i;
					empty[i][j] = 0;
					enemyCount++;
				}
				else if (enemyCount == 2)
				{
					u3x = j;
					u3y = i;
					empty[i][j] = 0;
					enemyCount++;
				}
				else if (enemyCount == 3)
				{
					u4x = j;
					u4y = i;
					empty[i][j] = 0;
					enemyCount++;
				}
				else
					printf("맵 배열상에 표기된 4(유령)의 수가 많습니다.(4 초과)");
				break;

				//----------------이하 색 벽 함수
			case 5:
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 9);
				printf("■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				break;
			case 6:
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
				printf("■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				break;
				// ---------------이하 아이템
			case 7:
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 13);
				printf("＠");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				break;
			case 8:
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				printf("●");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				break;

			}

		}
		

		printf("\n");
	}
	if (stage == 1) // 스테이지 1 에서 에펠탑 출력
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(105, 16);
		printf("모으는 재료 : 버거빵");
		gotoxy(101, 18);
		printf("          ■■■■");
		gotoxy(101, 19);
		printf("      ■■■■■■■■");
		gotoxy(101, 20);
		printf("    ■■■■■■■■■■");
		gotoxy(101, 21);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 22);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 24);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 25);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 26);
		printf("   ■■■■■■■■■■■");
		gotoxy(101, 29);
		printf("             %%%%");
		gotoxy(101, 30);
		printf("            *■*");
		gotoxy(101, 31);
		printf("            ■■");
		gotoxy(101, 32);
		printf("           .■■.");
		gotoxy(101, 33);
		printf("           :■■:");
		gotoxy(101, 34);
		printf("           =■■=");
		gotoxy(101, 35);
		printf("            ....");
		gotoxy(101, 36);
		printf("          #%%%%%%%%%%%%#");
		gotoxy(101, 37);
		printf("          .■■■.");
		gotoxy(101, 38);
		printf("          =■■■=");
		gotoxy(101, 39);
		printf("          ■■■■");
		gotoxy(101, 40);
		printf("         :■*  *■:");
		gotoxy(101, 41);
		printf("         ■@    ■@");
		gotoxy(101, 42);
		printf("        :**=    =**:");
		gotoxy(101, 43);
		printf("      :==:::====:::==+.");
		gotoxy(101, 44);
		printf("      *■■■■■■■%%.");
		gotoxy(101, 45);
		printf("     .■■■#++#■■■");
		gotoxy(101, 46);
		printf("    .■■@=      =■■@.");
		gotoxy(101, 47);
		printf("    ■■@:        :■■@");
		gotoxy(101, 48);
		printf("  .■■@%%          %%■■@.");
		gotoxy(101, 49);
		printf("  %%■■@*          *■■@%%");
	}
	else if (stage == 2) // 스테이지2에서 자유의 여신상 출력
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
		gotoxy(101, 23);
		printf("   ■■■■■■■■■■■");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
		gotoxy(101, 29);
		printf("     ■");
		gotoxy(101, 30);
		printf("    ■■");
		gotoxy(101, 31);
		printf("    ■■");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(105, 16);
		printf("모으는 재료 : 패티");
		gotoxy(101, 18);
		printf("          ■■■■");
		gotoxy(101, 19);
		printf("      ■■■■■■■■");
		gotoxy(101, 20);
		printf("    ■■■■■■■■■■");
		gotoxy(101, 21);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 22);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 24);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 25);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 26);
		printf("   ■■■■■■■■■■■");
		gotoxy(111, 31);
		printf("■ ■ ■");
		gotoxy(101, 32);
		printf("     ■    ■■■");
		gotoxy(101, 33);
		printf("     ■ ■■    ■■");
		gotoxy(101, 34);
		printf("     ■■■      ■■");
		gotoxy(101, 35);
		printf("      ■ ■      ■");
		gotoxy(101, 36);
		printf("      ■■■    ■");
		gotoxy(101, 37);
		printf("      ■■ ■■■");
		gotoxy(101, 38);
		printf("       ■   ■■■■■■");
		gotoxy(101, 39);
		printf("       ■ ■■    ■  ■");
		gotoxy(101, 40);
		printf("        ■■     ■   ■");
		gotoxy(101, 41);
		printf("        ■     ■ ■ ■");
		gotoxy(101, 42);
		printf("        ■ ■■   ■■");
		gotoxy(101, 43);
		printf("        ■■■   ■");
		gotoxy(101, 44);
		printf("        ■    ■■■");
		gotoxy(101, 45);
		printf("       ■  ■■  ■");
		gotoxy(101, 46);
		printf("       ■■■      ■");
		gotoxy(101, 47);
		printf("     ■■■■■■■■■");
		gotoxy(101, 48);
		printf("     ■ .. Liberty.. ■");
		gotoxy(101, 49);
		printf("     ■■■■■■■■■");
	}
	else if (stage == 3) // 스테이지 3 에서 경복궁 출력
	{
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
		gotoxy(101, 23);
		printf("   ■■■■■■■■■■■");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
		gotoxy(101, 24);
		printf(" ■■■■■■■■■■■■■");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
		gotoxy(101, 25);
		printf("   ■■■■■■■■■■■");
		SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
		gotoxy(105, 16);
		printf("모으는 재료 : 채소");
		gotoxy(101, 18);
		printf("          ■■■■");
		gotoxy(101, 19);
		printf("      ■■■■■■■■");
		gotoxy(101, 20);
		printf("    ■■■■■■■■■■");
		gotoxy(101, 21);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 22);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 26);
		printf(" ■■■■■■■■■■■■■");
		gotoxy(101, 27);
		printf("  ■■■■■■■■■■■■");
		gotoxy(101, 28);
		printf("   ■■■■■■■■■■■");
		gotoxy(101, 40);  // 고궁
		printf("         i!!!!!!!!i");
		gotoxy(101, 41);
		printf("      ,v■■■■■■v,");
		gotoxy(101, 42);
		printf("    U■■■■■■■■■U");
		gotoxy(101, 43);
		printf("      `n■■■■■■n`");
		gotoxy(101, 44);
		printf("    ,x■■■■■■■■r,");
		gotoxy(101, 45);
		printf("      ,■■■■■■■,");
		gotoxy(101, 46);
		printf("    (■■■■■■■■■)");
		gotoxy(101, 47);
		printf("  (■■■■$Y  Y$■■■■)");
		gotoxy(101, 48);
		printf("[$■■■■■|  |■■■■■$]");
		gotoxy(101, 49);
		printf("?illllllllli^  ^illllllllli?");

	}
	gotoxy(startx * 2, starty);
}

void gotoxy(int x, int y)
{
	COORD position = { x, y };
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), position);
}

void disappear() { // goto사용시 깜박이는 콘솔의 커서 제거, 참고문헌 http://tip.daum.net/question/39372106
	HANDLE hConsole; // 콘솔 핸들
	CONSOLE_CURSOR_INFO ConsoleCursor; // 콘솔커서 정보 구조체

	hConsole = GetStdHandle(STD_OUTPUT_HANDLE); // 핸들을 구하고

	ConsoleCursor.bVisible = 0; // 1 보임 , 0 안보임
	ConsoleCursor.dwSize = 1; // 커서 사이즈

	SetConsoleCursorInfo(hConsole, &ConsoleCursor); // 설정
}

void printTitle()
{
	/*int color[2] = { 14,15 };//색상  ->http://tmong.tistory.com/entry/C-setcolor-1 //while문으로 깜박거리지만 메뉴선택에서 while문이 걸려 빤짝거리지않음. 주석처리. / 11. 29. 수정
	static int i;//후훗,, 고급기능인 스태틱변수
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), color[i]);*/

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
	int x = 5, y = 5; // 팩맨 캐릭터 텍스쳐
	gotoxy(x, y); y += 1;
	printf("       ■■■■■■");
	gotoxy(x, y); y += 1;
	printf("    ■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("  ■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf(" ■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf(" ■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("  ■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("    ■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("       ■■■■■■");
	//i = (i + 1) % 2; //while문으로 깜박거리지만 메뉴선택에서 while문이 걸려 빤짝거리지않음. 주석처리. / 11. 29. 수정

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15); // 햄버거 텍스쳐
	x = 32;  y = 4;
	gotoxy(x, y); y += 1;
	printf("           ■■■■■■");
	gotoxy(x, y); y += 1;
	printf("       ■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("     ■■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("   ■■■■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf(" ■■■■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
	gotoxy(x, y); y += 1;
	printf("  ■■■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2);
	gotoxy(x, y); y += 1;
	printf("■■■■■■■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4);
	printf("  ■■■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(x, y); y += 1;
	printf("■■■■■■■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf(" ■■■■■■■■■■■■■■■■");
	gotoxy(x, y); y += 1;
	printf("  ■■■■■■■■■■■■■■■");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14); // 봉
	x = 72;  y = 5;
	gotoxy(x, y); y += 1;
	printf(" BO     NG");
	gotoxy(x, y); y += 1;
	printf(" KANGBONGB"); // KANG
	gotoxy(x, y); y += 1;
	printf(" ON     GB");
	gotoxy(x, y); y += 1;
	printf(" ONCHAEGBO"); // CHAE
	gotoxy(x, y); y += 1;
	printf("    NGB");
	gotoxy(x, y); y += 1;
	printf("ONGYEONBONG"); // YEON
	gotoxy(x, y); y += 1;
	printf("  BONGBON");
	gotoxy(x, y); y += 1;
	printf(" GBO   NGB");
	gotoxy(x, y); y += 1;
	printf(" ONG   BON");
	gotoxy(x, y); y += 1;
	printf("  GBONGBO");

	x = 90;  y = 5; // 재
	gotoxy(x, y); y += 1;
	printf("       JA EJ");
	gotoxy(x, y); y += 1;
	printf("AEJAE  JA EJ");
	gotoxy(x, y); y += 1;
	printf("AEJAE  JA NG"); //JANG
	gotoxy(x, y); y += 1;
	printf("   AE  ## SE"); //SE
	gotoxy(x, y); y += 1;
	printf("  AEJ  YEONG"); //YEONG
	gotoxy(x, y); y += 1;
	printf("  JAE  JA EJ");
	gotoxy(x, y); y += 1;
	printf("AEJ AE JA EJ");
	gotoxy(x, y); y += 1;
	printf("AE   JAEJ AE");
	gotoxy(x, y); y += 1;
	printf("       JA EJ");
	gotoxy(x, y); y += 1;
	printf("       AE JA");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15); // 의
	x = 108, y = 6;
	gotoxy(x, y); y += 1;
	printf("  =8E+   M#");
	gotoxy(x, y); y += 1;
	printf(" MM:~#M` ME");
	gotoxy(x, y); y += 1;
	printf(".M=  `Mi ME");
	gotoxy(x, y); y += 1;
	printf(" MM.`8M. ME");
	gotoxy(x, y); y += 1;
	printf("  +MMO`  ME");
	gotoxy(x, y); y += 1;
	printf("~.```~:I~ME");
	gotoxy(x, y); y += 1;
	printf("MMMMM#E8;ME");
	gotoxy(x, y); y += 1;
	printf("         ME");
	gotoxy(x, y); y += 1;
	printf("         8+");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 햄
	x = 72;  y = 17;
	gotoxy(x, y); y += 1;
	printf("  HA   MH AM");
	gotoxy(x, y); y += 1;
	printf("HAMHAM HA MH");
	gotoxy(x, y); y += 1;
	printf(" AMHA  MH AM");
	gotoxy(x, y); y += 1;
	printf("HA  MH AMHAM");
	gotoxy(x, y); y += 1;
	printf(" HAMH  AM HA");
	gotoxy(x, y); y += 1;
	printf("\n");
	gotoxy(x, y); y += 1;
	printf("    MHAMHAMH");
	gotoxy(x, y); y += 1;
	printf("    AM    HA");
	gotoxy(x, y); y += 1;
	printf("    MH    AM");
	gotoxy(x, y); y += 1;
	printf("    HAMHAMHA");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 버
	x = 90;  y = 17;
	gotoxy(x, y); y += 1;
	printf("         BU");
	gotoxy(x, y); y += 1;
	printf(" RB  UR  BU");
	gotoxy(x, y); y += 1;
	printf(" RB  UR  BU");
	gotoxy(x, y); y += 1;
	printf(" RBURBU  RB");
	gotoxy(x, y); y += 1;
	printf(" URBURBURBU");
	gotoxy(x, y); y += 1;
	printf(" RB  UR  BU");
	gotoxy(x, y); y += 1;
	printf(" RBURBU  RB");
	gotoxy(x, y); y += 1;
	printf(" URBURB  UR");
	gotoxy(x, y); y += 1;
	printf("         BU");
	gotoxy(x, y); y += 1;
	printf("         RB");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 거
	x = 108;  y = 17;
	gotoxy(x, y); y += 1;
	printf("         GE");
	gotoxy(x, y); y += 1;
	printf("RGERGER  GE");
	gotoxy(x, y); y += 1;
	printf("RGERGER  GE");
	gotoxy(x, y); y += 1;
	printf("    RGERGER");
	gotoxy(x, y); y += 1;
	printf("    GERGERG");
	gotoxy(x, y); y += 1;
	printf("  ERG    ER");
	gotoxy(x, y); y += 1;
	printf(" GER     GE");
	gotoxy(x, y); y += 1;
	printf("RGE      RG");
	gotoxy(x, y); y += 1;
	printf("         ER");
	gotoxy(x, y); y += 1;
	printf("         GE");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15); // 여
	x = 72;  y = 29;
	gotoxy(x, y); y += 1;
	printf(" ;EMO   iM`");
	gotoxy(x, y); y += 1;
	printf("iMi~MM+oEM`");
	gotoxy(x, y); y += 1;
	printf("ME  `M8;OM`");
	gotoxy(x, y); y += 1;
	printf("Mo   M+ IM`");
	gotoxy(x, y); y += 1;
	printf("ME  .##HAN`"); //HAN
	gotoxy(x, y); y += 1;
	printf("=M+JIN~~O#`"); //JIN - O
	gotoxy(x, y); y += 1;
	printf(" :8#+   iM`");
	gotoxy(x, y); y += 1;
	printf("        iM`");
	gotoxy(x, y); y += 1;
	printf("        ;E`");

	x = 85;  y = 28; // 행
	gotoxy(x, y); y += 1;
	printf("  :::` .` :");
	gotoxy(x, y); y += 1;
	printf(" `8O8: MO:M.");
	gotoxy(x, y); y += 1;
	printf("oMEEEMiMo~M`");
	gotoxy(x, y); y += 1;
	printf(" .E##I MMMM`");
	gotoxy(x, y); y += 1;
	printf(" Mi .M Mo:M`");
	gotoxy(x, y); y += 1;
	printf(" IMMM+ Mo~M`");
	gotoxy(x, y); y += 1;
	printf("    ;+8oi=;");
	gotoxy(x, y); y += 1;
	printf("  ;M8I:;=MM");
	gotoxy(x, y); y += 1;
	printf("  ;M+~..:#M");
	gotoxy(x, y); y += 1;
	printf("    iOEEoI");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 9); // 비행기 그림 텍스쳐
	x = 99;  y = 29;
	gotoxy(x, y); y += 1;
	printf("                        ;MMM");
	gotoxy(x, y); y += 1;
	printf("  =#M#EO+=;:.        ;8MMMMM");
	gotoxy(x, y); y += 1;
	printf("  MMMMMMMMMMMMMMJEOnGMMMMMMM"); //JEOnG
	gotoxy(x, y); y += 1;
	printf("   `Io#MMMMMMMMMMMMMMMMMMMo.");
	gotoxy(x, y); y += 1;
	printf("        .IoEMMMMMMMMMMMSE"); //SE
	gotoxy(x, y); y += 1;
	printf("          `iMMMMMMMMMMWON."); //WON
	gotoxy(x, y); y += 1;
	printf("  `     =MMMMMMMMMMMMMMMMM");
	gotoxy(x, y); y += 1;
	printf("MMMMM#EMMMMMMMM8: oMMMMMMM=");
	gotoxy(x, y); y += 1;
	printf("=8MMMMMMMMMMM=     ~MMMMMMM");
	gotoxy(x, y); y += 1;
	printf("   ~+MMMMMMM         OMMMMME");
	gotoxy(x, y); y += 1;
	printf("      =MMMMMO         :MMMME");
	gotoxy(x, y); y += 1;
	printf("        I##=`           I.");
}

void gameMenu() // 게임 메뉴
{
	int x = 20, y = 20;

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(x, y);
	printf("■□□□■■■□□■■□□■■");
	gotoxy(x, y + 1);
	printf("■■■□★■□□  ♪■■□□■");
	gotoxy(x, y + 2);
	printf("□□□■봉재's  Travel□■☆■");
	gotoxy(x, y + 3);
	printf("■■□■■햄□버■거□□■□□");
	gotoxy(x, y + 4);
	printf("■■★■□□□■■■□■■□□");

	gotoxy(x + 7, y + 8);
	printf("1. 여행 START");
	gotoxy(x + 7, y + 10);
	printf("2. 여행이어하기");
	gotoxy(x + 7, y + 12);
	printf("3. 여행점수확인");
	gotoxy(x + 7, y + 14);
	printf("4. The End");
	gotoxy(x + 0, y + 17);
	printf("메뉴선택 후 SPACE바를 누르세요.");
}

void gameMenuSelector() // 게임 메뉴 선택
{
	int cursorPoint = 1;
	int select = 0;

	while (1)
	{
		if (cursorPoint == 1)
		{
			gotoxy(24, 28); printf("◀");
			gotoxy(43, 28); printf("▶");
			system("pause>null");
			if (GetAsyncKeyState(VK_DOWN) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨(입닫음) 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 28); printf(" ");
				gotoxy(43, 28); printf(" ");
				cursorPoint++;
			}
			if (GetAsyncKeyState(VK_SPACE)) // SPACE키 입력되면 실행.
			{
				select = cursorPoint;
				cursorPoint = 0;
				system("cls");

				Intro1();
			//	Title();
			}
		}
		else if (cursorPoint == 2)
		{
			gotoxy(24, 30); printf("◀");
			gotoxy(43, 30); printf("▶");
			system("pause>null");
			if (GetAsyncKeyState(VK_DOWN) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 30); printf(" ");
				gotoxy(43, 30); printf(" ");
				cursorPoint++;
			}
			if (GetAsyncKeyState(VK_UP) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 30); printf(" ");
				gotoxy(43, 30); printf(" ");
				cursorPoint--;
			}
			if (GetAsyncKeyState(VK_SPACE))
			{
				select = cursorPoint;
				cursorPoint = 0;
				system("cls");


				stage = load();
				loadGame();


				
				return;
			}
		}
		else if (cursorPoint == 3)
		{
			gotoxy(24, 32); printf("◀");
			gotoxy(43, 32); printf("▶");
			system("pause>null");
			if (GetAsyncKeyState(VK_DOWN) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨(입닫음) 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 32); printf(" ");
				gotoxy(43, 32); printf(" ");
				cursorPoint++;
			}
			if (GetAsyncKeyState(VK_UP) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨(입닫음) 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 32); printf(" ");
				gotoxy(43, 32); printf(" ");
				cursorPoint--;
			}
			if (GetAsyncKeyState(VK_SPACE))
			{
				select = cursorPoint;
				cursorPoint = 0;
				system("cls");
				printRank();
			}
		}
		else if (cursorPoint == 4)
		{
			gotoxy(24, 34); printf("◀");
			gotoxy(43, 34); printf("▶");
			system("pause>null");
			if (GetAsyncKeyState(VK_UP) & 0x0001)
			{
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
				int x = 5, y = 5; // 팩맨 캐릭터 텍스쳐
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf("■■■■■■■■　　　　　");
				gotoxy(x, y); y += 1;
				printf(" ■■■■■■■■■　　　");
				gotoxy(x, y); y += 1;
				printf("  ■■■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("    ■■■■■■■■■");
				gotoxy(x, y); y += 1;
				printf("       ■■■■■■");
				SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
				gotoxy(24, 34); printf(" ");
				gotoxy(43, 34); printf(" ");
				cursorPoint--;
			}
			if (GetAsyncKeyState(VK_SPACE))
			{
				cursorPoint = 0;
				system("cls");
				gotoxy(55, 21);
				printf("--여행을 마칩니다--");
				gotoxy(48, 23); // 계속하려면 아무 키나 누르십시오 . . . 정렬을 위해 커서 옮김.
				Sleep(2000);
				exit(1);
			}
		}
	}
}

void Intro1()
{
	system("mode con:cols=130 lines=53"); // 인트로에서 130x53으로 맞추고 그후로 이 상태로 진행.
	int i;
	//int count;

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	gotoxy(38, 15);
	printf("봉재의 햄버거 여행기 1");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
	gotoxy(101, 44);
	printf("          ▶");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 45);
	printf("          l");
	gotoxy(101, 46);
	printf("    ■■■■■■");
	gotoxy(101, 47);
	printf("    ■■    ■■");
	gotoxy(101, 48);
	printf("  ■■■    ■■■");
	gotoxy(101, 49);
	printf("■■■■■■■■■■");
	gotoxy(101, 50);
	printf("■■■■■■■■■■");
	gotoxy(101, 51);
	printf("■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2);
	gotoxy(125, 46);
	printf("■");
	gotoxy(123, 47);
	printf("■■■");
	gotoxy(123, 48);
	printf("■■■");
	gotoxy(123, 49);
	printf("■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4);
	gotoxy(125, 50);
	printf("■");
	gotoxy(125, 51);
	printf("■");
	
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	Sleep(1000);
	gotoxy(36, 19);
	printf("XXXX년 XX월 XX일 선문대학교");
	Sleep(1500);
	gotoxy(28, 23);
	printf("봉재: 하암, 아메리카나 햄버거는 질려");
	Sleep(1000);
	gotoxy(34, 25);
	printf("그렇다고 프랜차이즈 버거들은 더 질리고...");
	Sleep(1000);
	gotoxy(34, 27);
	printf("어디 맛있는... 그래! 내가 세계각지를 다니면서");
	Sleep(1000);
	gotoxy(34, 29);
	printf("가장 맛있는 햄버거를 만드는거야!");
	gotoxy(50, 33);
	printf("Enter 키를 눌러주세요.");
	getchar();
	system("cls");
	Intro1_1();
}

void Intro1_1()
{
	int i;
	//int count;

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	gotoxy(38, 15);
	printf("봉재의 햄버거 여행기 1");
	PlaySound(TEXT("Airplane sound.wav"), NULL, SND_FILENAME | SND_ASYNC);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 9);
	gotoxy(101, 2);
	printf("        ■■    ■■");
	gotoxy(101, 3);
	printf("         ■■■■■");
	gotoxy(101, 4);
	printf("           ■■■");
	gotoxy(101, 5);
	printf("            ■■");
	gotoxy(101, 6);
	printf("            ■■");
	gotoxy(101, 7);
	printf("  +:        ■■        :+");
	gotoxy(101, 8);
	printf("  ■#+:     ■■     :+#■");
	gotoxy(101, 9);
	printf("  ■■■■  ■■  ■■■■");
	gotoxy(101, 10);
	printf("  +■■■■■■■■■■■+");
	gotoxy(101, 11);
	printf("    *■■■■■■■■■*");
	gotoxy(101, 12);
	printf("     #■■■■■■■■#");
	gotoxy(101, 13);
	printf("        %%■■■■■%%");
	gotoxy(101, 14);
	printf("          *■■■*");
	gotoxy(101, 15);
	printf("           ■■■");
	gotoxy(101, 16);
	printf("           ■■■");
	gotoxy(101, 17);
	printf("           ■■■");
	gotoxy(101, 18);
	printf("            ■■");
	Sleep(5500);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(38, 19);
	printf("XXXX년 XX월 XX일 프랑스");
	PlaySound(TEXT("La Marseillaise.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	gotoxy(101, 31);
	printf("             %%%%");
	gotoxy(101, 32);
	printf("            *■*");
	gotoxy(101, 33);
	printf("            ■■");
	gotoxy(101, 34);
	printf("           .■■.");
	gotoxy(101, 35);
	printf("           :■■:");
	gotoxy(101, 36);
	printf("           =■■=");
	gotoxy(101, 37);
	printf("            ....");
	gotoxy(101, 38);
	printf("          #%%%%%%%%%%%%#");
	gotoxy(101, 39);
	printf("          .■■■.");
	gotoxy(101, 40);
	printf("          =■■■=");
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("         :■*  *■:");
	gotoxy(101, 43);
	printf("         ■@    ■@");
	gotoxy(101, 44);
	printf("        :**=    =**:");
	gotoxy(101, 45);
	printf("      :==:::====:::==+.");
	gotoxy(101, 46);
	printf("      *■■■■■■■%%.");
	gotoxy(101, 47);
	printf("     .■■■#++#■■■");
	gotoxy(101, 48);
	printf("    .■■@=      =■■@.");
	gotoxy(101, 49);
	printf("    ■■@:        :■■@");
	gotoxy(101, 50);
	printf("  .■■@%%          %%■■@.");
	gotoxy(101, 51);
	printf("  %%■■@*          *■■@%%");
	Sleep(1500);
	gotoxy(28, 23);
	printf("봉재: 여기가 빵으로 유명한 프랑스인가?");
	Sleep(1000);
	gotoxy(34, 25);
	printf("프랑스 각지에 버거빵 재료가 흩어져 있다고 하는데");
	Sleep(1000);
	gotoxy(34, 27);
	printf("버거 도둑들을 피해서 재료를 모으자!!");
	Sleep(1000);
	gotoxy(34, 29);
	printf("프랑스에서 가장 맛있는 버거빵을 만드는거야!");
	gotoxy(50, 33);
	printf("Enter 키를 눌러주세요.");
	getchar();
	system("cls");
	gameStart();
}

void Intro2()
{
	int i;
	//int count;
	score = score + 10; // 스테이지 2 가면서 점수에 초기 먹이값 1의 점수 10점 추가
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	gotoxy(38, 15);
	printf("봉재의 햄버거 여행기 2");
	PlaySound(TEXT("Airplane sound.wav"), NULL, SND_FILENAME | SND_ASYNC);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 9);
	gotoxy(101, 2);
	printf("        ■■    ■■");
	gotoxy(101, 3);
	printf("         ■■■■■");
	gotoxy(101, 4);
	printf("           ■■■");
	gotoxy(101, 5);
	printf("            ■■");
	gotoxy(101, 6);
	printf("            ■■");
	gotoxy(101, 7);
	printf("  +:        ■■        :+");
	gotoxy(101, 8);
	printf("  ■#+:     ■■     :+#■");
	gotoxy(101, 9);
	printf("  ■■■■  ■■  ■■■■");
	gotoxy(101, 10);
	printf("  +■■■■■■■■■■■+");
	gotoxy(101, 11);
	printf("    *■■■■■■■■■*");
	gotoxy(101, 12);
	printf("     #■■■■■■■■#");
	gotoxy(101, 13);
	printf("        %%■■■■■%%");
	gotoxy(101, 14);
	printf("          *■■■*");
	gotoxy(101, 15);
	printf("           ■■■");
	gotoxy(101, 16);
	printf("           ■■■");
	gotoxy(101, 17);
	printf("           ■■■");
	gotoxy(101, 18);
	printf("            ■■");
	Sleep(5500);

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(38, 19);
	printf("XXXX년 XX월 XX일 미국");
	PlaySound(TEXT("America Theme.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12);
	gotoxy(101, 31);
	printf("     ■");
	gotoxy(101, 32);
	printf("    ■■");
	gotoxy(101, 33);
	printf("    ■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(111, 33);
	printf("■ ■ ■");
	gotoxy(101, 34);
	printf("     ■    ■■■");
	gotoxy(101, 35);
	printf("     ■ ■■    ■■");
	gotoxy(101, 36);
	printf("     ■■■      ■■");
	gotoxy(101, 37);
	printf("      ■ ■      ■");
	gotoxy(101, 38);
	printf("      ■■■    ■");
	gotoxy(101, 39);
	printf("      ■■ ■■■");
	gotoxy(101, 40);
	printf("       ■   ■■■■■■");
	gotoxy(101, 41);
	printf("       ■ ■■    ■  ■");
	gotoxy(101, 42);
	printf("        ■■     ■   ■");
	gotoxy(101, 43);
	printf("        ■     ■ ■ ■");
	gotoxy(101, 44);
	printf("        ■ ■■   ■■");
	gotoxy(101, 45);
	printf("        ■■■   ■");
	gotoxy(101, 46);
	printf("        ■    ■■■");
	gotoxy(101, 47);
	printf("       ■  ■■  ■");
	gotoxy(101, 48);
	printf("       ■■■      ■");
	gotoxy(101, 49);
	printf("     ■■■■■■■■■");
	gotoxy(101, 50);
	printf("     ■ .. Liberty.. ■");
	gotoxy(101, 51);
	printf("     ■■■■■■■■■");

	Sleep(1000);
	gotoxy(28, 23);
	printf("봉재: 여기가 햄버거의 고장 미국이구나!!");
	Sleep(1000);
	gotoxy(34, 25);
	printf("최고의 소고기 패티를 위해 소고기를 구하자!");
	Sleep(1000);
	gotoxy(24, 27);
	printf("목장주인: 네 이놈!! 어디서 소고기를 몰래 훔쳐가려고해!");
	Sleep(1000);
	gotoxy(28, 29);
	printf("봉재: 목장주인들을 피해 소고기를 얼른 구하자!");
	gotoxy(50, 33);
	printf("Enter 키를 눌러주세요.");
	getchar();
	system("cls");

}

void Intro3()
{
	int i;
	//int count;
	score = score + 10; // 스테이지 3 가면서 점수에 초기 먹이값 1의 점수 10점 추가
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	gotoxy(38, 15);
	printf("봉재의 햄버거 여행기 3");
	PlaySound(TEXT("Airplane sound.wav"), NULL, SND_FILENAME | SND_ASYNC); // 다른 나라로 가면서 나오는 비행기 효과음.
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 9);
	gotoxy(101, 2);
	printf("        ■■    ■■");
	gotoxy(101, 3);
	printf("         ■■■■■");
	gotoxy(101, 4);
	printf("           ■■■");
	gotoxy(101, 5);
	printf("            ■■");
	gotoxy(101, 6);
	printf("            ■■");
	gotoxy(101, 7);
	printf("  +:        ■■        :+");
	gotoxy(101, 8);
	printf("  ■#+:     ■■     :+#■");
	gotoxy(101, 9);
	printf("  ■■■■  ■■  ■■■■");
	gotoxy(101, 10);
	printf("  +■■■■■■■■■■■+");
	gotoxy(101, 11);
	printf("    *■■■■■■■■■*");
	gotoxy(101, 12);
	printf("     #■■■■■■■■#");
	gotoxy(101, 13);
	printf("        %%■■■■■%%");
	gotoxy(101, 14);
	printf("          *■■■*");
	gotoxy(101, 15);
	printf("           ■■■");
	gotoxy(101, 16);
	printf("           ■■■");
	gotoxy(101, 17);
	printf("           ■■■");
	gotoxy(101, 18);
	printf("            ■■");
	Sleep(5500);

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(36, 19);
	printf("XXXX년 XX월 XX일 대한민국");
	PlaySound(TEXT("wish of korea.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 42);
	printf("         i!!!!!!!!i");
	gotoxy(101, 43);
	printf("      ,v■■■■■■v,");
	gotoxy(101, 44);
	printf("    U■■■■■■■■■U");
	gotoxy(101, 45);
	printf("      `n■■■■■■n`");
	gotoxy(101, 46);
	printf("    ,x■■■■■■■■r,");
	gotoxy(101, 47);
	printf("      ,■■■■■■■,");
	gotoxy(101, 48);
	printf("    (■■■■■■■■■)");
	gotoxy(101, 49);
	printf("  (■■■■$Y  Y$■■■■)");
	gotoxy(101, 50);
	printf("[$■■■■■|  |■■■■■$]");
	gotoxy(101, 51);
	printf("?illllllllli^  ^illllllllli?");

	Sleep(1000);
	gotoxy(28, 23);
	printf("봉재: 역시 싱싱한 채소는 우리나라에서 구해야겠지?");
	Sleep(1000);
	gotoxy(34, 25);
	printf("토마토와 양상추를 구해볼까?");
	Sleep(1000);
	gotoxy(26, 27);
	printf("도둑들: 싱싱한 토마토와 양상추는 우리가 가져가겠다!");
	Sleep(1000);
	gotoxy(28, 29);
	printf("봉재: 도둑놈들에게 채소를 빼았길 순 없지! 얼른 구하자!");
	gotoxy(50, 33);
	printf("Enter 키를 눌러주세요.");
	getchar();
	system("cls");
}

void Title()
{
	system("mode con:cols=130 lines=43"); // 타이틀화면에서만 130x43 크기로 지정. (깔끔해보이도록 조정)

	system("title 봉재의 햄버거 여행기");
	PlaySound(TEXT("payday.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	//사운드 파일 위치, SND_ASYNC, SND_LOOP 세가지가 제일 중요
	//SND_ASYNC : 재생하면서 다음코드 실행
	//SND_LOOP : 반복재생
	int key;
	
		printTitle();
		gameMenu();
		gameMenuSelector();


		Sleep(100);
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
		{
			key = _getch();//키를 입력 받음 key에 저장하는 이유는 타이틀 탈출시의 엔터 중복입력 방지 
			system("cls");//타이틀 지움
			SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);//색을 흰색을 복구
			
		}

	
}

void Ending() //엔딩 추가하기
{
	int i;
	int x = 5, y = 5;

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");
	
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
	gotoxy(101, 44);
	printf("          ▶");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 45);
	printf("          l");
	gotoxy(101, 46);
	printf("    ■■■■■■");
	gotoxy(101, 47);
	printf("    ■■    ■■");
	gotoxy(101, 48);
	printf("  ■■■    ■■■");
	gotoxy(101, 49);
	printf("■■■■■■■■■■");
	gotoxy(101, 50);
	printf("■■■■■■■■■■");
	gotoxy(101, 51);
	printf("■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2);
	gotoxy(125, 46);
	printf("■");
	gotoxy(123, 47);
	printf("■■■");
	gotoxy(123, 48);
	printf("■■■");
	gotoxy(123, 49);
	printf("■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4);
	gotoxy(125, 50);
	printf("■");
	gotoxy(125, 51);
	printf("■");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(36, 15);
	printf("봉재의 햄버거 여행기 마지막 장");
	PlaySound(TEXT("Spongebob.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
	Sleep(1000);
	gotoxy(37, 19);
	printf("XXXX년 XX월 XX일 선문대학교");
	Sleep(1500);
	gotoxy(28, 23);
	printf("봉재: 드디어 세계 각지에서 최고의 재료를 모아서");
	Sleep(1500);
	gotoxy(34, 25);
	printf("최고의 햄버거를 만들었어!!");
	Sleep(1500);
	gotoxy(34, 27);
	printf("한번 먹어볼까??");
	Sleep(5000);
	gotoxy(28, 31);
	printf("봉재: 진짜 맛있다!! 이번 여행은 대성공!!");
	gotoxy(50, 35);
	printf("Enter 키를 눌러주세요.");
	getchar();
	system("cls");
}

void credit()
{
	int i;
	int x = 5, y = 5;

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");

	gotoxy(45, 20);
	printf("Map, load");
	gotoxy(43, 25);
	printf("Chae Yeon, Kang");

	Sleep(3000);

	system("cls");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(45, 20);
	printf("Map, save");
	gotoxy(43, 25);
	printf("Se Yeong, Jang");

	Sleep(3000);

	system("cls");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");

	gotoxy(43, 20);
	printf("Interface, Design");
	gotoxy(45, 25);
	printf("Se Won, Jeong");

	Sleep(3000);

	system("cls");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");


	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 46);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 47);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 48);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("      ■■■■■■■■");
	gotoxy(101, 43);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 44);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 45);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 49);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 50);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 51);
	printf("   ■■■■■■■■■■■");

	gotoxy(45, 20);
	printf("Logic");
	gotoxy(43, 25);
	printf("Jin O, Han");

	Sleep(3000);

	system("cls");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 46);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 47);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 48);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("      ■■■■■■■■");
	gotoxy(101, 43);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 44);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 45);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 49);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 50);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 51);
	printf("   ■■■■■■■■■■■");

	gotoxy(45, 20);
	printf("Game By");
	gotoxy(38, 25);
	printf("SunMoon University, 2016");

	Sleep(3000);

	system("cls");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 46);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 47);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 48);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("      ■■■■■■■■");
	gotoxy(101, 43);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 44);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 45);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 49);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 50);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 51);
	printf("   ■■■■■■■■■■■");

	gotoxy(44, 21);
	printf("Thanks For Playing");

	//Sleep(2000);

	//gotoxy(47, 23);
	//printf("Thank You!!!");

	Sleep(6000);
}

void printRank()//***2012244063 한진오***
{
	system("mode con:cols=130 lines=53");
	int key = 1;
	int x = 37, y = 15; // ■안에 넣기위해서 x값 수정 / 12. 02 SW수정
	int rank, frank = 2, score, i = 1;
	char name[10] = { 0, };
	char a = 0;
	FILE *fpin = 0;//파일포인터변수의선언

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 46);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 47);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 48);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("      ■■■■■■■■");
	gotoxy(101, 43);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 44);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 45);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 49);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 50);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 51);
	printf("   ■■■■■■■■■■■");

	fpin = fopen("source.txt", "r");

	if (fpin == NULL)//랭크 파일이 없을경우.
	{
		gotoxy(x, y);
		printf("아직 기록되지 않았습니다.");
		return;
	}
	gotoxy(x, y); y = y + 2;
	printf("RANK\tNAME\tSCORE\n");
	while (!feof(fpin))//파일의 끝이면 0이 아닌값, 끝이면 0 반환.->http://me.tistory.com/380
	{
		fscanf(fpin, "%d %s %d ", &rank, name, &score);
		gotoxy(x, y); y = y + 2;
		if (rank != frank)//개행 문자 때문에 마지막 순위가 두번 입력되어, 전번 순위와 같을시 기록이 안되게 함.
		{
			printf("%3d\t%s\t%4d\n", rank, name, score); // %3d, %4d를 사용함으로서 깔끔하게 출력 /SW 12.03 수정
			frank = rank;
		}
		else
			break;
	}

	gotoxy(34, 39);
	printf("계속하려면 아무 키나 누르세요.");
	
	while (1)
	{
		if (_kbhit())//키 입력 여부 확인 ->http://showmiso.tistory.com/8
		{
			key = GetAsyncKeyState(VK_SPACE);//키를 입력 받음. (스페이스 중복입력 방지) // _getch() 이게 key에 값을 입력 못해서 계속 다음 타이틀까지 사용됨. / SW 12. 03 수정
			break;
		}
	}
	system("cls");
	Title();

}

void goRank(int score)//***2012244063 한진오***
{
	system("mode con:cols=130 lines=53");

	int count = 0, i = 0;
	char name[10] = { 0, };

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 12); // 토마토
	gotoxy(101, 6);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 19);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 33);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 46);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 2); // 양상추
	gotoxy(101, 7);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 20);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 34);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 47);
	printf(" ■■■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4); // 패티
	gotoxy(101, 8);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 21);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 35);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 48);
	printf("   ■■■■■■■■■■■");
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 15);
	gotoxy(101, 1);
	printf("          ■■■■");
	gotoxy(101, 2);
	printf("      ■■■■■■■■");
	gotoxy(101, 3);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 4);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 5);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 9);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 10);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 11);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 14);
	printf("          ■■■■");
	gotoxy(101, 15);
	printf("      ■■■■■■■■");
	gotoxy(101, 16);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 17);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 18);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 22);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 23);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 24);
	printf("   ■■■■■■■■■■■");

	gotoxy(101, 28);
	printf("          ■■■■");
	gotoxy(101, 29);
	printf("      ■■■■■■■■");
	gotoxy(101, 30);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 31);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 32);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 36);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 37);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 38);
	printf("   ■■■■■■■■■■■");
	gotoxy(101, 41);
	printf("          ■■■■");
	gotoxy(101, 42);
	printf("      ■■■■■■■■");
	gotoxy(101, 43);
	printf("    ■■■■■■■■■■");
	gotoxy(101, 44);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 45);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 49);
	printf(" ■■■■■■■■■■■■■");
	gotoxy(101, 50);
	printf("  ■■■■■■■■■■■■");
	gotoxy(101, 51);
	printf("   ■■■■■■■■■■■");

	gotoxy(30, 13);
	printf("=====================================");
	gotoxy(30, 15); // ■안에 출력하기 위해 추가
	printf("영문 5자 이하의 이니셜을 입력하세요!!");
	gotoxy(30, 19);
	printf("=====================================");
	gotoxy(48, 17);
	scanf("%s", name);
	

	FILE *fpin = 0, *fpout = 0;//파일포인터변수의선언


	fpin = fopen("source.txt", "r");

	if ((fpin == NULL))//파일이 없을 경우, 파일 생성 뒤, 1등 만 기록.
	{
		fpout = fopen("source.txt", "w");//make source file
		fprintf(fpout, "1\t%s\t%d", name, score);
		fclose(fpout);//파일 닫기 ㅠㅠ
		return;
	}

	//---------------------------------------------------여기부터는 기존의 파일 내용(랭크)을, 연결리스트에 저장하는 코드.
	RANK *list = NULL, *current, *follow, *ee, *empty;

	list = follow = current = (RANK*)malloc(sizeof(RANK));
	void findException(RANK current);//메모리가 부족할 경우의 예외처리.


	while (!feof(fpin))//파일이 끝날때까지 루프. (http://forum.falinux.com/zbxe/?mid=C_LIB&page=8&document_srl=408235 -> 파일의 끝을 알려주는 함수), 
					   //파일이 처음부터 공백일 수가 없는것이, 첫 1등 처리를 하였기 때문. 고로 따로 예외 처리 안함.
					   //파일로부터 순위, 이름, 점수를 연결리스트에 저장.
	{
		fscanf(fpin, "%d %s %d", &current->rankNum, current->name, &current->score);//파일로부터 순위, 이름, 점수를 불러와, 노드에 저장.


		empty = (RANK*)malloc(sizeof(RANK));
		void findException(RANK empty);//메모리가 부족할 경우의 예외처리.

		current->next = empty;

		ee = follow;
		follow = current;//마지막으로 입력될 노드를 찾기 위함.
		current = current->next;//다음 노드에 입력을 준비함, 루프의 마지막일 경우, current는 쓰레기값.
		i++;
	}
	if (i == 1)//1등 뿐일때.
	{
		list->next = NULL;
	}
	else//랭크에 기록된 사람이 2 이상일때.
	{
		free(current);//마지막 빈 노드의 동적메모리 해제.
		free(follow);//이유는 모르겠으나 쓰레기값임
		ee->next = NULL;//예외 처리 방지.. 마지막 노드 ee의 next가 NULL로 초기화가 안되면, 제어문에서 불편함.
	}

	//-------------------------------------------------------------------------------------------------------이하 새로운, 점수 기록용 노드의 생성
	if ((empty = (RANK*)malloc(sizeof(RANK))) == NULL)//사용자가 입력한 이름, 점수를 새로운 노드에 입력.
	{
		printf("No memory allocated..\n");//역시 예외처리
	}
	strcpy(empty->name, name);//본인의 이름
	empty->score = score;//본인의 score
	empty->next = NULL;//제어문 오류 방지.

					   //-----------------------------------------------------이하 연결리스트에서의, 내림차순 노드 삽입(점수를 기준으로 함)

	current = list;

	while ((current != 0) && (current->score > score))
	{
		follow = current;
		current = current->next;
	}
	// 삽입
	empty->next = current;
	if (current == list)//1등일 경우
	{
		list = empty;
		empty->rankNum = 1; gotoxy(40, 21); printf("당신의 순위는 %d등!", empty->rankNum);
		while (1)//본 노드 이하의 모든 노드들의 석차를 1씩 증가.
		{
			empty = empty->next;// printf("No memory allocated..1\n");
			if (empty != NULL)
				empty->rankNum += 1;

			else break;
		}
	}
	else// 중간, 혹은 마지막일 경우.
	{
		follow->next = empty;
		empty->rankNum = follow->rankNum + 1; gotoxy(40, 21);  printf("당신의 순위는 %d등!", empty->rankNum);
		while (1)//본 노드 이하의 모든 노드들의 석차를 1씩 증가.
		{
			empty = empty->next; //printf("No memory allocated..2\n");
			if (empty != NULL)
				empty->rankNum += 1;
			else break;
		}
	}

	//-----------------------------------------------------이하 10위권 밖의 노드 삭제 과정.

	empty = current = follow = list;//여기서 empty는 10위의 노드를 찾음.(최종적으로, follow가 11위, current는 NULL 값임.)

	while (current != NULL)//count가 노드의 갯수를 셈.
	{
		count++;
		empty = follow;
		follow = current;
		current = current->next;
	}

	if (follow->rankNum == 11)//11위권일 경우(count가 11일 경우)의 처리, 마지막 노드(empty)의 next를 NULL처리.
	{
		free(follow);
		empty->next = NULL;
	}

	//----------------------------------------------------------이하 파일에 출력


	fpout = fopen("source.txt", "w");

	current = list;
	while (current != NULL)//이하 연결리스트의 데이터를 순차적으로 파일에 출력.
	{
		fprintf(fpout, "%d\t%s\t%d\n", current->rankNum, current->name, current->score);
		current = current->next;
	}

	RANK *freeNode;

	while (list != NULL) {
		freeNode = list; // freeNode -> head로 초기화
		list = list->next; // head는 head가 가르키는 다음 노드를 가르킨다
		free(freeNode); // 메모리 해제
	}

	fclose(fpin);
	fclose(fpout);

	return;
}

COORD getXY() {
	COORD Cur;
	CONSOLE_SCREEN_BUFFER_INFO a;

	GetConsoleScreenBufferInfo(GetStdHandle(STD_OUTPUT_HANDLE), &a);
	Cur.X = a.dwCursorPosition.X;
	Cur.Y = a.dwCursorPosition.Y;
	return Cur;
}

void save(int stage, int *scoreP, int mapArr[50][50]) {
	
	FILE *fpin;
	int i,j;

	fpin = fopen("save.txt", "w");

	fprintf(fpin, "%d %d", stage,scoreP);

	for (i = 0; i < 50; i++)
	{
		for (j = 0; j < 50; j++)
		{
			fprintf(fpin," %d", empty[i][j]);

		}
	}
	
	Sleep(1000);
	fclose(fpin);
}

int load()
{
	system("mode con:cols=130 lines=53");
	FILE *fp;
	int a,i,j;

	fp = fopen("save.txt", "r");
	if (fp == NULL)
	{
		printf("기록되지 않음");
		Sleep(1000);
		return 1;
	}

	fscanf(fp, "%d %d", &a,scoreP);

	for (i = 0; i < 50; i++)
	{
		for (j = 0; j < 50; j++)
		{
			fscanf(fp, "%d",&empty[i][j]);
		}
	}

	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
	for (i = 0; i < 50; i++)
		printf("■                                                                                                ■\n");
	printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");

	gotoxy(45, 21);
	printf("스테이지 : %d", a);
	gotoxy(45, 22);
	printf("score : %d", *scoreP);

	Sleep(1500);


	return a;
}